export const TIMELINE_DATA = [
    { year: "2016年", title: "淡水魚ライフワークプロジェクトに参加", desc: "中学校の「ライフワーク」プロジェクトで、淡水魚の取材とレポート作成に取り組み、江ノ島水族館や東京海洋大学などに取材。学んだことをレポートにまとめ、学内発表を行った。" },
    { year: "2023年", title: "Web制作の独学開始", desc: "大学2年後期からHTML/CSS/JavaScriptを独学で学び、Webサイト制作のスキルを習得。プログラミングやデザインの基礎を身につけ、個人制作で実践。" },
    { year: "2023年", title: "Web制作インターンシップに参加", desc: "フルリモートでのWeb制作インターンシップに参加し、クライアントのニーズに応じたWebサイトの制作を担当。デザインと機能性を兼ね備えたサイトを納品。" },
    { year: "2024年", title: "ライフイズテックにてUnityメンターとして中高生を指導開始", desc: "大学の友人の勧めでUnityコースに参加し、VRゲームの制作にも挑戦。Web制作スキルと併用し、ゲーム開発の新しい分野に挑戦。中高生のゲーム開発を指導。" },
    { year: "2024年", title: "Navi-奈良市_AI1DAY (Web)に参加", desc: "生成AIを使って、奈良市をテーマにしたWebサイトの構成ができ、また、構成に沿ったWebサイト作成を手助けする。プログラミングが嫌いな子もいた中で、班の全員が納得いくものが完成できました。" },
    { year: "2025年", title: "Re-Build in 愛知 2025 優秀賞 受賞", desc: "サイバーエージェント主催のハッカソンにて、戦略的オンラインゲームをチームで開発。技術面では、オブジェクトプールを活用した高負荷に耐えうる射撃システムの実装や、スキルの内部ロジック、サウンド制御などを担当。パフォーマンスを意識した設計が評価され、優秀賞を受賞しました。" },
    { year: "2026年", title: "実務課題を解決する勤怠管理Webアプリの制作", desc: "勤務先の飲食店における締め日の集計業務を効率化するため、Next.jsとFirebaseを用いて開発。キーボード操作の手間を省く音声入力機能と、複雑な勤務シフトに対応した自動計算ロジックを実装。現場の事務作業コストを大幅に削減し、実用性の高いツールとして運用。" },
];

export const SKILLS_DATA = [
    { name: "Python", desc: "FastAPIを勉強中。基本的なCRUD操作やトークンを用いた認証を用いたAPI開発が可能" },
    { name: "HTML/CSS", desc: "Webサイトを依頼されてつくったことがある　中高生向け指導経験あり" },
    { name: "React", desc: "Reactを用いたコンポーネント指向のWebアプリケーション開発が可能" },
    { name: "Unity", desc: "2D・3Dゲームの基礎制作が可能　中高生向け指導経験あり" },
    { name: "Git/GitHub", desc: "基本的なバージョン管理、チームコラボレーションが可能　チーム開発経験あり" },
];

export const EDUCATION_DATA = [
    { date: "2015年4月", event: "愛知教育大学附属岡崎中学校　入学" },
    { date: "2018年3月", event: "愛知教育大学附属岡崎中学校　卒業" },
    { date: "2018年4月", event: "私立名城大学附属高校　入学" },
    { date: "2021年3月", event: "私立名城大学附属高校　卒業" },
    { date: "2022年4月", event: "名城大学情報工学部情報工学科　入学" },
    { date: "2026年3月", event: "名城大学情報工学部情報工学科　卒業" },
    { date: "2026年4月", event: "名城大学大学院 情報工学研究科 入学" }
];